PastorCatto/PURR-OS-ESP32/jc3248w535-purec/sdkconfig.defaults
# PURR OS — JC3248W535 (ESP32-S3-WROOM-1 N16R8) — pure ESP-IDF build
CONFIG_IDF_TARGET="esp32s3"

# 16 MB QIO flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_OCT_FLASH=n
CONFIG_ESPTOOLPY_FLASH_MODE_QIO=y

# OPI PSRAM (8 MB octal, N16R8) — required for the display framebuffer
CONFIG_SPIRAM=y
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=n
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# Custom partition table (factory + dual OTA + spiffs, 16 MB)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_jc3248w535.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# 240 MHz CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Performance
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y

# Main task needs room for display bring-up
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
